diary = {'понедельник': {
 'утро': ['погулять с собакой'],
 'день': [],
 'вечер': ['погулять с собакой']
 },
 'вторник': {
 'утро': ['погулять с собакой'],
 'день': [],
 'вечер': ['погулять с собакой']
 },
 'среда': {
 'утро': ['погулять с собакой'],
 'день': [],
 'вечер': ['погулять с собакой']
 },
 'четверг': {
 'утро': ['погулять с собакой'],
 'день': [],
 'вечер': ['погулять с собакой']
 },
 'пятница': {
 'утро': ['заехать в шиномонтаж', 'помыть машину'],
 'день': [],
 'вечер': ['поход в театр', 'ужин в кафе']
 },
 'суббота': {
 'утро': [],
 'день': [],
 'вечер': []
 },
 'воскресенье': {
 'утро': [],
 'день': [],
 'вечер': []
 }}

#1
diary.pop('суббота')
diary.pop('воскресенье')
diary[('суббота', 'воскресенье')] = ['посадить цветы на даче']

#2
diary[('вторник', 'утро')].append('поход к зубному')

#3
diary[('пятница', 'вечер')] = ['поход в кино']

#4
del diary[('среда', 'утро')][-1]

#5
print(diary[('пятница', 'утро')][1])

#6 ключа не будет в словаре, и при попытке получить дела на этот день
# будет ошибка KeyError.
del diary['понедельник']

#7
def print_schedule(day):
    if day in diary:
        if ('утро' in diary[day]):
            print("Утро:", ", ".join(diary[day]['утро']))
        else:
            print("Утро: Свободный день")
        if ('день' in diary[day]):
            print("День:", ", ".join(diary[day]['день']))
        else:
            print("День: Свободный день")
        if ('вечер' in diary[day]):
            print("Вечер:", ", ".join(diary[day]['вечер']))
        else:
            print("Вечер: Свободный день")
    else:
        print("Свободный день")

#8
import datetime

today = datetime.datetime.today().strftime('%A').lower()
print_schedule(today)

#9
def reset_schedule():
    for day in diary:
        diary[day] = {'утро': [], 'день': [], 'вечер': []}
#10
def add_to_schedule():
    day = input("Введите день недели: ").lower()
    time = input("Введите время суток (утро/день/вечер): ")
    task = input("Введите задачу: ")
    if day not in diary:
        diary[day] = {'утро': [], 'день': [], 'вечер': []}
    diary[day][time].append(task)